In [1]:
import requests
import json
import pandas as pd

In [2]:
df1 = pd.read_csv("ventas.csv")
df1.sample(2)

    ID_Cliente ID_Producto Fecha_Venta  Cantidad  Total
0          723          A1  2023-11-22         2  17.98
24         876        AT46  2023-10-25         2   9.98

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID_Cliente   100 non-null    int64
 1   ID_Producto  100 non-null    object
 2   Fecha_Venta  100 non-null    object
 3   Cantidad     100 non-null    int64
 4   Total        100 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ KB

- Encontrar y eliminar duplicados

In [4]:
# Identificar los números duplicados
duplicados = df1[df1['ID_Cliente'].duplicated()]

# Extraer solo la columna 'employeenumber' de los duplicados
numeros_duplicados = duplicados['ID_Cliente']

# Imprimir los números duplicados
print(numeros_duplicados)

# si solo quieres los valores unicos de los duplicados.
print(numeros_duplicados.unique())

# si quieres contar los duplicados.
print(numeros_duplicados.value_counts())

25    123
30    234
31    876
32    543
33    908
     ...
95    234
96    987
97    543
98    234
99    987
Name: ID_Cliente, Length: 70, dtype: int64
[123 234 876 543 908 312 987 798 321 654 765 567 789 456]
ID_Cliente
234    20
543    13
987    13
876    10
321     3
654     2
765     2
123     1
908     1
312     1
798     1
567     1
789     1
456     1
Name: count, dtype: int64

In [5]:
def eliminar_duplicados_empleado(df):

    df = df.drop_duplicates(subset='ID_Cliente', keep='first')
    return df

In [6]:
df = eliminar_duplicados_empleado(df1) #aplicamos la función al df

In [28]:
df.to_csv("clientes_limpio.csv", index=False)

In [8]:
df2 = pd.read_csv("productos.csv", sep=";")
df2.sample(2)

,ID,Nombre_Producto,Categoría,Precio,Origen,Descripción
16,Q17,Pasta de Trigo,Productos Secos,3.99,Italia,"Deliciosa pasta de trigo durum italiana, ideal..."
25,Z26,Calzone,Pizzas,7.49,Italia,"Pizza cerrada y horneada, rellena de queso, sa..."

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               33 non-null     object
 1   Nombre_Producto  33 non-null     object
 2   Categoría        33 non-null     object
 3   Precio           33 non-null     float64
 4   Origen           33 non-null     object
 5   Descripción      33 non-null     object
dtypes: float64(1), object(5)
memory usage: 1.7+ KB

- Encontrar y eliminar duplicados

In [10]:
# Identificar los números duplicados
duplicados = df2[df2['ID'].duplicated()]

# Extraer solo la columna 'employeenumber' de los duplicados
numeros_duplicados = duplicados['ID']

# Imprimir los números duplicados
print(numeros_duplicados)

# si solo quieres los valores unicos de los duplicados.
print(numeros_duplicados.unique())

# si quieres contar los duplicados.
print(numeros_duplicados.value_counts())

Series([], Name: ID, dtype: object)
[]
Series([], Name: count, dtype: int64)

In [29]:
df2.to_csv("productos_limpio.csv", index=False)

In [11]:
df3 = pd.read_csv("clientes.csv")
df3.sample(2)

,id,first_name,last_name,email,gender,City,Country,Address
155,156,Aldin,Squibe,asquibe4b@dagondesign.com,Male,Cadiz,Spain,3859 Trailsway Center
456,457,Betsey,Hammant,bhammantco@qq.com,Female,Vitoria-Gasteiz,NaN,732 Esker Street

In [12]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          1000 non-null   int64
 1   first_name  1000 non-null   object
 2   last_name   1000 non-null   object
 3   email       973 non-null    object
 4   gender      923 non-null    object
 5   City        876 non-null    object
 6   Country     846 non-null    object
 7   Address     959 non-null    object
dtypes: int64(1), object(7)
memory usage: 62.6+ KB

- Encontrar y eliminar duplicados

In [13]:
# Identificar los números duplicados
duplicados = df3[df3['id'].duplicated()]

# Extraer solo la columna 'employeenumber' de los duplicados
numeros_duplicados = duplicados['id']

# Imprimir los números duplicados
print(numeros_duplicados)

# si solo quieres los valores unicos de los duplicados.
print(numeros_duplicados.unique())

# si quieres contar los duplicados.
print(numeros_duplicados.value_counts())

Series([], Name: id, dtype: int64)
[]
Series([], Name: count, dtype: int64)

- Columnas fusionadas, separar

In [14]:
df3["Address"].head().reset_index()

   index                   Address
0      0  076 Rockefeller Crossing
1      1        0046 Utah Junction
2      2          0 Corry Crossing
3      3       5 American Ash Road
4      4         9289 Merry Circle

In [16]:

import re

def split_address(address):
    """
    Separa la dirección en número y ciudad, manejando valores no-cadena.
    """
    if isinstance(address, str):
        match = re.match(r'(\d+)\s+(.*)', address)
        if match:
            return match.group(1), match.group(2)
        else:
            return None, None
    else:
        return None, None

# Supongamos que tu DataFrame es 'df'
df3[['Cod', 'Address']] = df3['Address'].apply(lambda x: pd.Series(split_address(x)))

df3

,id,first_name,last_name,email,gender,City,Country,Address,Cod
0,1,Cheri,Dunsmore,cdunsmore0@instagram.com,Female,Palma De Mallorca,Spain,Rockefeller Crossing,076
1,2,Hunt,Bartomeu,hbartomeu1@nsw.gov.au,Male,Lugo,Spain,Utah Junction,0046
2,3,Michaeline,Paynton,mpaynton2@narod.ru,Female,NaN,Spain,Corry Crossing,0
3,4,Filmer,Eirwin,feirwin3@intel.com,NaN,Leon,Spain,American Ash Road,5
4,5,Tanhya,Lubbock,tlubbock4@huffingtonpost.com,Female,"Hospitalet De Llobregat, L'",Spain,Merry Circle,9289
...,...,...,...,...,...,...,...,...,...
995,996,Ray,Tarpey,rtarpeyrn@bravesites.com,Female,Zamora,Spain,Sommers Terrace,36384
996,997,Flem,Roderham,froderhamro@dropbox.com,Male,Pontevedra,Spain,Eastwood Parkway,93177
997,998,Winifield,Blakes,wblakesrp@jiathis.com,Male,Vigo,Spain,Grayhawk Road,03044
998,999,Lanita,Espinosa,lespinosarq@discuz.net,Female,Dos Hermanas,Spain,Schmedeman Drive,2
999,1000,Grissel,Siberry,gsiberryrr@wikispaces.com,Female,Leon,Spain,Waywood Terrace,42274

- Elimanr columna no necesaria por ser un solo pais "España"

In [18]:
df3["Country"].unique()

array(['Spain', nan], dtype=object)

In [19]:
df3.drop("Country", axis=1, inplace=True)

In [21]:
df3.sample(3)

,id,first_name,last_name,email,gender,City,Address,Cod
654,655,Dexter,Haward,dhawardi6@zdnet.com,Male,Valladolid,Amoth Trail,92
566,567,Chickie,Corkhill,ccorkhillfq@china.com.cn,Male,Valladolid,4th Street,9
64,65,Farlay,Donisi,fdonisi1s@meetup.com,Male,Almeria,Graedel Crossing,7

In [23]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          1000 non-null   int64
 1   first_name  1000 non-null   object
 2   last_name   1000 non-null   object
 3   email       973 non-null    object
 4   gender      923 non-null    object
 5   City        876 non-null    object
 6   Address     959 non-null    object
 7   Cod         959 non-null    object
dtypes: int64(1), object(7)
memory usage: 62.6+ KB

In [30]:
df3.to_csv("ventas_limpio.csv", index=False)